W8D1/reddit_clone/app/controllers/application_controller.rb

    def require_moderator_power
        redirect_to sub_url(Sub.find(params[:id])) unless logged_in? && @current_user.id == Sub.find(params[:id]).moderator_id
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]