W8D1/reddit_clone/app/controllers/posts_controller.rb

    def create

        @post = Post.new(post_params)
        @post.sub_id = params[:sub_id]
        @post.author_id = current_user.id

        if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "Hello"], ["url", "sajkdhaskjdh"], ["content", "Hi"], ["sub_id", 10], ["author_id", 2], ["created_at", "2020-09-15 00:00:43.808604"], ["updated_at", "2020-09-15 00:00:43.808604"]]