W8D1/reddit_clone/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Dolls"], ["description", "I like Dolls"], ["moderator_id", 2], ["created_at", "2020-09-14 22:13:09.752124"], ["updated_at", "2020-09-14 22:13:09.752124"]]
---
    def create
        @sub = Sub.new(sub_params)
        @sub.moderator_id = params[:user_id]

        if @sub.save