W7D2/music_app/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "hulk@gmail.com"], ["LIMIT", 1]]
---
    def self.find_by_credentials(email, password)
        user = User.find_by email: email