W8D1/reddit_clone/app/models/user.rb

    def password=(password)
        @password = password
        self.password_digest = BCrypt::Password.create(password)
---
INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

    def reset_session_token!
        self.session_token = SecureRandom::urlsafe_base64
        self.save!
---
INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "XKUurddLKOC4FBYXUpSKhA"], ["updated_at", "2020-09-14 22:10:38.938380"], ["id", 13]]