W11D3/bench_bnb/bench_bnb/app/controllers/api/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
   def create
      # //debugger
      @user = User.new(user_params)
      if @user.save