W11D4/bench_bnb/app/controllers/api/benches_controller.rb

SELECT "benches".* FROM "benches"
---
   def index
      @benches = Bench.all

SELECT "benches".* FROM "benches" WHERE (lat <= 37.80971 AND lat >= 37.74187) AND (lng <= -122.39208 AND lng >= -122.47791) ORDER BY "benches"."id" ASC
---
   def show
      @bench = Bench.find(params[:id])