W11D4/bench_bnb/app/models/user.rb

   def self.find_by_credentials(username, password)
      user = User.find_by(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Boosqua"], ["LIMIT", 1]]

   def reset_session_token!
    self.session_token = SecureRandom.urlsafe_base64
    self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "LxEZqCTDZPg-RztQCplHmQ"], ["updated_at", "2020-10-07 22:18:00.304766"], ["id", 2]]