W11D3/bench_bnb/bench_bnb/app/controllers/application_controller.rb

   def current_user
      return nil unless session[:session_token]

      @current_user ||= User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "HVKZF9YtPrCZu1RGRvSjAA"], ["LIMIT", 1]]