W8D1/reddit_clone/app/views/subs/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."sub_id" = $1  [["sub_id", 15]]
---

    <% @sub.posts.each do |post| %>